{"basics":{"name":"Mengmeng Wang","label":"Data Scientist, Engineer, Researcher","image":"","url":"https://mengmwang.github.io/","summary":"A dedicated data scientist and researcher with a multidisciplinary background in electrical engineering, biomedical engineering, and computer science. Experienced in data cleaning and analysis, machine learning, and large language models.","location":{"address":"","postalCode":"","city":"","countryCode":"AU","region":""},"profiles":[{"network":"GitHub","username":"mengmwang","url":"https://github.com/mengmwang"},{"network":"LinkedIn","username":"mengmwang","url":"https://linkedin.com/in/mengmwang/"}]},"work":[{"name":"Centre for Youth Mental Health, Orygen","position":"Data Scientist","startDate":"2023-02-01","endDate":"","summary":"Worked end-to-end data and machine learning pipeline including data extraction, cleaning and statistical analysis.","highlights":["Experienced in data extraction, wrangling, and statistical analysis using structured and non-structured data","Applied machine learning algorithms and large language models in data analysis and health outcomes prediction","Contributed to developing statistical analysis plans and writing technical reports, research papers and policy briefings","Collaborated with clinicians, researchers, and policy makers to deliver data-driven solutions","Developed interactive dashboards and visualisations tools for non-technical stakeholders to support data-informed decision-making"]},{"name":"The University of Melbourne","position":"Data Processing & Machine Learning Tutor (Casual)","startDate":"2019-03-01","endDate":"2022-11-01","summary":"Delivered tutorials and practical workshops on data processing, machine learning, and signals & systems.","highlights":["Taught key topics including data wrangling, visualisation, natural language processing, supervised and unsupervised machine learning","Used Python libraries including Pandas, NumPy, and Scikit-Learn in teaching modern data science and advanced machine learning concepts"]}],"education":[{"institution":"The University of Melbourne","area":"Statistical Signal Processing","studyType":"Doctor of Philosophy","startDate":"2017","endDate":"2023","courses":[]},{"institution":"University of Bristol","area":"Image Processing","studyType":"Master of Science","startDate":"2013","endDate":"2014","courses":[]},{"institution":"Beijing University of Posts and Telecommunications","area":"Telecommunications Engineering","studyType":"Bachelor of Engineering","startDate":"2009","endDate":"2013","courses":[]}],"skills":[{"name":"Programming Languages","keywords":["Python","R","SQL","MATLAB"]},{"name":"Technical Tools","keywords":["GitHub","Tableau","Power BI","Excel"]},{"name":"Python Libraries","keywords":["Pandas","NumPy","Scikit-Learn","transformers","NLTK","SciPy","Matplotlib","JSON","RegEx"]},{"name":"Professional","keywords":["Data Analysis","Technical Writing","Project Management","Teamwork","Communications"]}],"projects":[{"name":"Clinical NLP and Predictive Modelling in Medical Case Notes","summary":"Applied advanced natural language processing techniques and large language models (LLMs) to extract, structure, and utilise insights from unstructured clinical text. This project includes text de-identification, topic clustering and outcome prediction.","url":"","highlights":["Project 1 - Medical case note de-identification: Developed an automated, large language models (LLMs) based de-identification pipeline to identify and identify and mask personally identifiable information (PII) from clinical notes. The solution integrates external data sources (eg. location-based information) and goes beyond generic NER by incorporating real-world domain-specific knowledge.","Project 2 - Topic Modelling and Clustering: Implemented a BERTopic-based framework to extract latent themes and group similar clinical case notes. Identified key clinical topics and themes through unsupervised clustering.","Project 3 - Outcome prediction: Designed and validated models using structured features and text embeddings to predict clinical outcomes."]},{"name":"EEG Data Analysis in Music Therapy","summary":"Analysed EEG data in music therapy research, including data cleaning, preprocessing, and statistical analysis.","url":"","highlights":["EEG data analysis and visualisation","Collaboration with health professionals, doctors and music therapists"]},{"name":"Financial Timeseries Processing and Forecast","summary":"Performed financial data analysis and timeseries forecasting using machine learning models.","url":"","highlights":["Data cleaning and preparation: outlier detection, data visualisation and feature engineering","Data analysis: correlation, moving-average, auto-regression analysis","Timeseries forecasting: auto-regression model and machine learning models (decision tree, logistic regression, neural networks)"]},{"name":"Customer Purchasing Behaviors Analysis","summary":"Analysed transaction data to find patterns in customer behavior.","url":"","highlights":["Data pipeline: cleaning, preparation and visualisation","Draw Business insights based on analysis results"]},{"name":"Reinforcement Learning and Multi-Armed Bandits (MABs)","summary":"Implemented and evaluated reinforcement learning algorithms including UCB and LinUCB.","url":"","highlights":["ϵ-Greedy, Upper Confidence Bound (UCB) models"]}],"publications":[{"name":"Using data linkage for mental health research in Australia","publisher":"Australian & New Zealand Journal of Psychiatry","releaseDate":"2025","url":"","summary":""},{"name":"The changing impacts of social determinants on youth mental health in Australia","publisher":"The International Journal of Social Psychiatry","releaseDate":"2025","url":"","summary":""},{"name":"Capturing the clinical complexity in young people presenting to primary mental health services: a data-driven approach","publisher":"Epidemiology and psychiatric sciences","releaseDate":"2024","url":"","summary":""},{"name":"Feasibility of clinical EEG for music recognition in children aged 1–12 years","publisher":"Frontiers in Pediatrics","releaseDate":"2024","url":"","summary":""},{"name":"Correction of induced functional connectivity in filtered resting state fNIRS data","publisher":"OHBM Annual Meeting","releaseDate":"2021","url":"","summary":""},{"name":"Correction for time-varying signal power in fNIRS connectivity analyses","publisher":"Society of fNIRS Virtual Conference","releaseDate":"2021","url":"","summary":""},{"name":"Motion Artefact Removal in Functional Near-infrared Spectroscopy Signals Based on Robust Estimation","publisher":"IEEE ICASSP","releaseDate":"2019","url":"","summary":""},{"name":"A very low complexity reduced reference video quality metric based on spatio-temporal information selection","publisher":"IEEE ICIP","releaseDate":"2015","url":"","summary":""}],"volunteer":[{"organization":"The University of Melbourne","position":"Girl Power Mentor","startDate":"2021-03-01","endDate":"2022-12-01","summary":"Mentored Year 11/12 female students interested in science and engineering.","highlights":["Encouraged young women to pursue STEM education"]}]}